**Extract, Transform, Load**

Extract, Transform, Load (ETL) is a process that extracts data from transactional databases, transforms the data, and loads the data into an analytic database. ETL transforms data in a staging area, such as a temporary database, prior to loading data to the analytic database. Extract, Load, Transform (ELT) is a variant of ETL that loads raw data directly to the analytic database and transforms the data in place.

ETL is similar to data wrangling. Both processes structure, clean, enrich, and publish data. However, data wrangling is usually an informal process, executed manually by data scientists on a static dataset. ETL is an automated process that repeatedly extracts new data from transactional databases. ETL is usually applied to larger data volumes and more sources than data wrangling.

ETL tools, also called data integration tools, extract and merge data from many different database systems. In principle, ETL tools can be used for data wrangling. However, because data wrangling is often manual and ad-hoc, data scientists usually prefer spreadsheets or programming languages such as Python, R, and SQL.

In [12]:
# Import Pandas package
import pandas as pd

# Construct dataframe example
example = pd.DataFrame(
    data=[
        ['China', 'Asia', 9572900],
        ['Bangladesh', 'Asia', 143998],
        ['Brazil', 'South America', 8547403],
        ['Norway', 'Europe', 358207],
    ],
    columns=['Country', 'Continent', 'Population'],
)

# Display example
example

      Country      Continent  Population
0       China           Asia     9572900
1  Bangladesh           Asia      143998
2      Brazil  South America     8547403
3      Norway         Europe      358207

In [13]:
# Show information about example
example.info(verbose=False)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Columns: 3 entries, Country to Population
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [14]:
# Display rows 1 through 3 and columns Country through Continent
example.loc[1:3, 'Country':'Continent']

      Country      Continent
1  Bangladesh           Asia
2      Brazil  South America
3      Norway         Europe

In [15]:
# Sort example on Continent
example.sort_values('Continent', ascending=False, inplace=True)

# Display sorted data
example

      Country      Continent  Population
2      Brazil  South America     8547403
3      Norway         Europe      358207
0       China           Asia     9572900
1  Bangladesh           Asia      143998

**Data manipulation**

The first step of the data wrangling process is data discovery, or exploring patterns and trends within a dataset. Data exploration can be done visually through plots or figures, or numerically by comparing descriptive statistics.

**Data manipulation** is the process of organizing or subsetting a dataset to explore a research problem. Data manipulation is used to split datasets into multiple groups based on a categorical feature, or compare values of a dataset according to a specific condition. After data manipulation, descriptive statistics like the mean, median, or proportion can be calculated and compared across groups or conditions.

In [16]:
# Import packages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Import data and display
country = pd.read_csv('data/country_complete.csv')
country

,Country,Continent,Years,Internet access,Emissions range,Fertility,Emissions,Internet
0,Afghanistan,Asia,3.8,Low,Low,4.33,0.254,16.8
1,Albania,Europe,10.0,Moderate,Low,1.71,1.590,65.4
2,Algeria,Africa,8.0,Low,Moderate,2.64,3.690,49.0
3,Angola,Africa,5.1,Low,Low,5.55,1.120,29.0
4,Argentina,Americas,9.9,High,Moderate,2.26,4.410,77.7
...,...,...,...,...,...,...,...,...
146,Uruguay,Americas,8.7,High,Moderate,1.97,2.010,80.7
147,Uzbekistan,Asia,11.5,Moderate,Moderate,2.23,2.810,55.2
148,Vietnam,Asia,8.2,Moderate,Moderate,1.95,2.160,69.8
149,Zambia,Africa,7.0,Low,Low,4.87,0.302,14.3
150,Zimbabwe,Africa,8.2,Low,Low,3.61,0.850,25.0

In [17]:
# Categorical features are sorted in alphabetical order by default
# np.size counts the number of entries
country['Internet access'] = country['Internet access'].astype('category')
country.pivot_table(
    values='Years', index='Continent', columns='Internet access', aggfunc=np.size
)

C:\Users\Arnav\AppData\Local\Temp\ipykernel_23908\2544210485.py:4: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  country.pivot_table(

Internet access  High   Low  Moderate  Very high
Continent
Africa            1.0  36.0       8.0        NaN
Americas          8.0   7.0      10.0        1.0
Asia             10.0  13.0       9.0        8.0
Europe           26.0   NaN       3.0        7.0
Oceania           2.0   1.0       1.0        NaN

In [18]:
# cat.reorder_categories is useful for rearranging the order
# (ex: low to high)
country['Internet access'] = country['Internet access'].cat.reorder_categories(
    ['Low', 'Moderate', 'High', 'Very high']
)
# Display the number of countries in a pivot table of continent and
# internet access
country.pivot_table(
    values='Years', index='Continent', columns='Internet access', aggfunc=np.size
)

C:\Users\Arnav\AppData\Local\Temp\ipykernel_23908\885719708.py:8: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  country.pivot_table(

Internet access   Low  Moderate  High  Very high
Continent
Africa           36.0       8.0   1.0        NaN
Americas          7.0      10.0   8.0        1.0
Asia             13.0       9.0  10.0        8.0
Europe            NaN       3.0  26.0        7.0
Oceania           1.0       1.0   2.0        NaN

In [19]:
# Which 7 countries in the Americas have low Internet access?
country[(country['Continent'] == 'Americas') & (country['Internet access'] == 'Low')]

,Country,Continent,Years,Internet access,Emissions range,Fertility,Emissions,Internet
14,Belize,Americas,10.5,Low,Low,2.44,1.500,49.8
17,Bolivia,Americas,8.9,Low,Low,2.80,1.960,44.3
43,El Salvador,Americas,6.9,Low,Low,2.04,1.110,43.8
56,Guatemala,Americas,6.5,Low,Low,2.87,1.070,41.5
59,Haiti,Americas,5.3,Low,Low,2.82,0.270,32.5
60,Honduras,Americas,6.5,Low,Low,2.39,1.040,36.0
101,Nicaragua,Americas,6.7,Low,Low,2.14,0.862,37.6

In [20]:
# Display the average number of years of schooling
country.pivot_table(
    values='Years', index='Continent', columns='Internet access', aggfunc="mean",observed=False
)

Internet access       Low   Moderate       High  Very high
Continent
Africa           4.836111   7.475000   9.500000        NaN
Americas         7.328571   9.220000   9.737500  13.300000
Asia             6.346154   9.566667  10.530000  10.100000
Europe                NaN  11.033333  11.588462  12.828571
Oceania          7.900000  10.800000  12.700000        NaN

In [21]:
# Display the average of each feature by continent

country.groupby(by=["Continent"]).mean(numeric_only=True)

               Years  Fertility  Emissions   Internet
Continent
Africa      5.408889   4.090889   1.127953  31.057778
Americas    9.026923   2.161154   3.309308  62.411538
Asia        8.867500   2.244000   7.431350  63.882500
Europe     11.783333   1.621944   6.716944  81.738889
Oceania    11.025000   2.460000   6.812750  68.725000

In [22]:
# Display the median of each feature by continent

country.groupby(by=["Continent"]).median(numeric_only=True)

           Years  Fertility  Emissions  Internet
Continent
Africa      5.20      4.410      0.434     25.00
Americas    8.70      2.130      2.260     63.40
Asia        9.35      2.020      3.925     67.15
Europe     12.05      1.605      5.905     81.30
Oceania    11.65      2.220      4.875     78.25

In [23]:
# Display the number of countries in the dataset
# for each continent

country.groupby(by=["Continent"]).size()

Continent
Africa      45
Americas    26
Asia        40
Europe      36
Oceania      4
dtype: int64

In [24]:
# Use describe on each feature for each continent

country.groupby(by=["Continent"]).describe()

          Years                                                         \
          count       mean       std  min     25%    50%     75%   max
Continent
Africa     45.0   5.408889  2.147496  1.5   3.600   5.20   6.800  10.1
Americas   26.0   9.026923  1.981829  5.3   7.925   8.70  10.125  13.5
Asia       40.0   8.867500  2.688474  3.1   7.175   9.35  10.825  13.0
Europe     36.0  11.783333  1.199405  9.2  11.250  12.05  12.425  14.2
Oceania     4.0  11.025000  2.273580  7.9  10.075  11.65  12.600  12.9

          Fertility            ... Emissions       Internet             \
              count      mean  ...       75%   max    count       mean
Continent                      ...
Africa         45.0  4.090889  ...    1.1600   8.1     45.0  31.057778
Americas       26.0  2.161154  ...    3.0225  16.6     26.0  62.411538
Asia           40.0  2.244000  ...    8.9450  38.0     40.0  63.882500
Europe         36.0  1.621944  ...    8.3625  15.9     36.0  81.738889
Oceania         4.0  2.460000  ...    9.7300  16.9      4.0  68.725000


                 std   min     25%    50%     75%   max
Continent
Africa     19.035893   4.1  15.800  25.00  43.000  70.1
Americas   17.080523  32.5  50.800  63.40  74.475  94.6
Asia       26.208081  15.3  43.900  67.15  84.675  99.7
Europe      9.654704  62.6  74.625  81.30  88.975  99.0
Oceania    27.771853  29.4  59.025  78.25  87.950  89.0

[5 rows x 32 columns]

In [25]:
# Display a subset of the data above using .agg()

country.groupby("Continent").agg(
    min_Emissions=pd.NamedAgg(column="Emissions", aggfunc="min"),
    max_Emissions=pd.NamedAgg(column="Emissions", aggfunc="max"),
    mean_Emissions=pd.NamedAgg(column="Emissions", aggfunc=np.mean),
)

C:\Users\Arnav\AppData\Local\Temp\ipykernel_23908\792008967.py:3: FutureWarning: The provided callable <function mean at 0x000001F7E5AD07C0> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  country.groupby("Continent").agg(

           min_Emissions  max_Emissions  mean_Emissions
Continent
Africa            0.0467            8.1        1.127953
Americas          0.2700           16.6        3.309308
Asia              0.2540           38.0        7.431350
Europe            1.5900           15.9        6.716944
Oceania           0.6010           16.9        6.812750

**Formatting data**

All data within a single column and similar data in multiple columns should be stored in a uniform format. Ex:

All dates and times might be stored as the datetime data type, with a 24-hour clock in Coordinated Universal Time (UTC).
All lengths might be stored as meters.
All percentages might be stored as decimal values between 0 and 1, rather than integers between 0 and 100.
All names of people might be stored as 'FirstName LastName' with no prefix, suffix, or middle initial.
A uniform storage format facilitates aggregating and comparing data within and across columns. Standardizing the storage format also minimizes analysis errors.

Although storage formats should be uniform, display formats may vary according to the audience. Ex: Gross Domestic Product (GDP) might be stored as integer dollars but displayed as billions of dollars.

**Feature scaling**

The numeric features in a dataset often have different scales. In some datasets, scales may differ by orders of magnitude. Many algorithms execute faster or generate better results when scales are similar or identical. Feature scaling converts numeric features to uniform ranges. Two common feature scaling methods are standardization and normalization.

**Standardization** converts features to a range centered at 0, with 1 representing a standard deviation:

$$ x_{standardized} = \frac{x_{original} - \mu_x}{\sigma_x}  $$

 is the mean and  is the standard deviation of feature . The standardized value is called a z-score. Since each unit represents one standard deviation, most z-scores fall between -2 and 2.

**Normalization** converts features to the range [0,1]:

$$ x_{normalized} = \frac{x_{original} - Min_x}{Max_x - Min_x} $$

Standardization is usually preferred over normalization, since standardization positions values relative to the mean and standard deviation. Normalization is useful when algorithms require all features on identical scales.

Standardization is best when outliers are present. Standardized values are not skewed by outliers, but most normalized values are compressed into a small range.

> **Terminology**
Feature scaling terminology varies. Standardization is sometimes called z-score normalization. Normalization is sometimes called min-max scaling.

**Structuring data with Python**

The Python language, and the pandas and sklearn packages, have many data structuring methods. Selected methods and functions that format, scale, and unpack data are described in the tables below. The tables include all required parameters and important optional parameters, but exclude infrequently used optional parameters.

string[start:end] is not a method but is useful for unpacking string columns and therefore included in the table.

Methods that change data contain an optional copy parameter. If copy is True, changes are returned in a new dataframe or array. If copy is False, changes are made to the input dataframe or array.

***Python data structuring methods.***
| Method	| Parameters	| Description |
| :-------- | :------------ | :---------- |
| string[start:end]	| none	| Returns the substring of string that begins at the index start and ends at the index end - 1. |
|string.capitalize()<br>string.upper()<br>string.lower()<br>string.title()	| none	| Returns a copy of string with the initial character uppercase, all characters uppercase, all characters lowercase, or the initial character of all words uppercase. |
| to_datetime()	| arg	| Converts arg to datetime data type and returns the converted object. Data type of arg may be int, float, str, datetime, list, tuple, one-dimensional array, Series, or DataFrame. |
| to_numeric()	| arg	| Converts arg to numeric data type and returns the converted object. Data type of arg may be scalar, list, tuple, one-dimensional array, or Series.|

**pandas data structuring methods.**
| Method	| Parameters	| Description |
| :-------- | :------------ | :---------- |
| df.astype()	| dtype<br>copy=True	| Converts the data type of all dataframe df columns to dtype. To alter individual columns, specify dtype as {col: dtype, col:dtype, . . .}. |
| df.insert()	| loc<br>column<br>value	| Inserts a new column with label column at location loc in dataframe df. value is a Scalar, Series, or Array of values for the new column. |

**sklearn data structuring methods.**
| Method	| Parameters	| Description |
| :-------- | :-----------  | :---------- |
| preprocessing.scale()	| X<br>axis=0<br>with_mean=True<br>with_std=True<br>copy=True	| Standardizes data in input **X** of data type Array or DataFrame. **axis** indicates whether to standarize along columns (0) or rows (1). **with_mean=True** centers the data at the mean value. **with_std=True** scales the data so that one represents a standard deviation. |
| preprocessing.MinMaxScaler().fit_transform() 	| feature_range=(0,1)<br>copy=True<br>X	| Normalizes data in input **X**, a **fit_transform()** parameter of data type Array or DataFrame. **feature_range** specifies the range of scaled data. **feature_range** and **copy** are **MinMaxScaler()** parameters.

In [26]:
# Import packages
import pandas as pd
from sklearn import preprocessing

# Import data into 'original'
original = pd.read_csv('data/featurescaling.csv')

original

    Price  Age
0   90300   14
1  150500   27
2  269500   22
3   98000   15
4  244650   28

In [27]:
# Standardize dataframe and return as an array
standardizedArray = preprocessing.scale(original)

# Convert standardized array to dataframe 'standardized'
standardized = pd.DataFrame(standardizedArray, columns=["Price", "Age"])

In [28]:
# Verify that standardized contains the expected values
standardized.head()

      Price       Age
0 -1.084852 -1.231895
1 -0.271449  0.992360
2  1.336439  0.136877
3 -0.980812 -1.060798
4  1.000674  1.163456

In [29]:
# Normalize dataframe and return as an array
normalizedArray = preprocessing.MinMaxScaler().fit_transform(original)

# Convert normalized array to dataframe 'normalized'
normalized = pd.DataFrame(normalizedArray, columns=["Price", "Age"])

In [30]:
# Verify that normalized contains the expected values
normalized.head()

      Price       Age
0  0.000000  0.000000
1  0.335938  0.928571
2  1.000000  0.571429
3  0.042969  0.071429
4  0.861328  1.000000

**Cleaning Data**

**Dirty data**

Raw datasets often contain missing, outlier, and duplicate data.

**Missing data** is an unknown or inapplicable value. In a database, missing data is represented as **NULL**. In Python, missing data is represented as **NaN** (not a number), **NaT** (not a time), **None** (an unspecified object), or a blank value.

**Outlier data** is a numeric value that is much larger or smaller than other values in the same feature. Outlier data is usually defined as two or three standard deviations from the feature mean.

**Duplicate data** are two or more identical instances in a dataset. Duplicate instances are usually erroneous and should be removed.

Missing, outlier, and duplicate data are collectively called **dirty data**. A **dirty instance** and a **dirty feature** contain dirty data.

Dirty data creates bias and inefficiencies in data analysis. Data scientists may struggle to interpret missing data. Values in erroneous duplicates appear too often and are weighted too heavily. Outliers skew results due to one potentially erroneous value. Consequently, missing, outlier, and duplicate data should be corrected or deleted.

**Discarding data**

Dirty data may be removed from a dataset by discarding instances, discarding features, or pairwise discarding.

**Discarding instances**, also called **listwise deletion** or **complete case removal**, removes dirty instances from the dataset. Dirty instances are usually discarded when:
- The dirty instances comprise a small percentage of the dataset.
- The dirty instances are random. When missing or outlier values are correlated with values in another feature, discarding dirty instances introduces bias.
- Instances are duplicates. Usually, duplicate instances are erroneous, and one instance should be discarded.

**Discarding features** removes dirty features that contain a high percentage of missing values, such as 60% or more. Discarding features does not usually apply to outlier data since, by definition, a small percentage of values can be outliers. Discarding features never applies to duplicate data.

**Pairwise discarding** retains dirty instances for some analyses and discards dirty instances for others. Instances are discarded only when an analysis uses a dirty feature. With pairwise discarding, the total number of instances varies for different analyses, which complicates comparisons and correlations. For this reason, pairwise discarding is not commonly used.

**Imputing data**

**Imputing data** replaces missing and outlier data with new values. Imputing is more complex than discarding but retains all instances and features. Data may be imputed in several ways:
- **Hot-deck** and **cold-deck** imputation replace missing and outlier data with a value from a randomly selected instance. In hot-deck imputation, the value is selected from other instances in the same dataset. In cold-deck imputation, the value is selected from a different dataset.

- **Mean imputation** replaces missing and outlier data with the mean value of the feature. Missing and outlier data are excluded from the computation of the mean.

- **Regression imputation** replaces missing and outlier data with a value computed from a regression model. In the regression model, the dependent variable is the dirty feature and the independent variables are other features. **Stochastic regression imputation** introduces uncertainty by adding or subtracting the regression variance to the new value. Regression models are discussed elsewhere in this material.

Regression imputation is valuable if the dirty feature is highly correlated with other features. If not, mean imputation is commonly used. Hot- and cold-deck imputation were common when less computer power was available to compute mean and regression but are not widely used today.

**pandas data cleaning methods.**
| Method	| Parameters	| Description |
| :-------- | :------------ | :---------- |
| df.drop()	| labels=None<br>axis=0<br>inplace=False	| Removes rows (axis=0) or columns (axis=1) from dataframe df. labels specifies the labels of rows or columns to drop. |
| df.drop_duplicates()	| subset=None<br>inplace=False	| Removes duplicate rows from df. subset specifies the labels of columns used to identify duplicates. If subset=None, all columns are used. |
| df.dropna()	| axis=0<br>how='any'<br>subset=None<br>inplace=False	| Removes rows (axis=0) or columns (axis=1) containing missing values from df.  subset specifies labels on the opposite axis to consider for missing values. how indicates whether to drop the row or column if any or if all values are missing. |
|df.duplicated()	| subset=None	| Returns a Boolean series that identifies duplicate rows in df. true indicates a duplicate row. subset specifies the labels of columns used to identify duplicates. If subset=None, all columns are used. |
| df.fillna()	| value=None<br>inplace=False	| Replaces NA and NaN values in df with value, which may be a scalar, dict, Series, or DataFrame. |
| df.isnull()<br>df.isna()	| none	| Returns a dataframe of Boolean values. True in the returned dataframe indicates the corresponding value of the input df is None, NaT or NaN. |
|df.mean()	| axis=0<br>skip_na=True<br>numeric_only=None	| Returns the mean values of rows (axis=0) or columns (axis=1) of  df.  skipna indicates whether to exclude unknown values in the calculation. numeric_only indicates whether to exclude non-numeric rows or columns. |
| df.replace()	|to_replace=None<br>value=NoDefault.no_default<br>inplace=False	| Replaces to_replace values in df with value. to_replace and value may be str, dict, list, regex, or other data types. |

In [31]:
# Import packages
import pandas as pd

# Import dataset
auto = pd.read_csv("data/autodata.csv")
# Display auto
auto

  Manufacturer        Model  Drive EngineType  Cylinders  Liters    MPG
0         Audi           A4    All        Gas        4.0     2.0   24.0
1          BMW       328 Ci   Rear        Gas        6.0     3.6   20.0
2      Bentley  Continental   Rear        Gas        NaN     NaN  210.0
3    Chevrolet       Malibu  Front        Gas        6.0     3.6   18.0
4         Ford      Mustang   Rear        Gas        6.0     3.7    NaN
5  Rolls-Royce        Ghost   Rear        Gas       12.0     6.6   12.0
6    Chevrolet       Malibu  Front        Gas        6.0     3.6   18.0

In [32]:
# Remove duplicates from dataset
auto.drop_duplicates(inplace=True)
# Display auto
auto

  Manufacturer        Model  Drive EngineType  Cylinders  Liters    MPG
0         Audi           A4    All        Gas        4.0     2.0   24.0
1          BMW       328 Ci   Rear        Gas        6.0     3.6   20.0
2      Bentley  Continental   Rear        Gas        NaN     NaN  210.0
3    Chevrolet       Malibu  Front        Gas        6.0     3.6   18.0
4         Ford      Mustang   Rear        Gas        6.0     3.7    NaN
5  Rolls-Royce        Ghost   Rear        Gas       12.0     6.6   12.0

In [33]:
# Remove rows with missing values for both Cylinders and Liters
auto.dropna(subset=['Cylinders', 'Liters'], how='all', inplace=True)
# Display auto
auto

  Manufacturer    Model  Drive EngineType  Cylinders  Liters   MPG
0         Audi       A4    All        Gas        4.0     2.0  24.0
1          BMW   328 Ci   Rear        Gas        6.0     3.6  20.0
3    Chevrolet   Malibu  Front        Gas        6.0     3.6  18.0
4         Ford  Mustang   Rear        Gas        6.0     3.7   NaN
5  Rolls-Royce    Ghost   Rear        Gas       12.0     6.6  12.0

In [34]:
# Compute mean values of numeric features
mean = auto.mean(numeric_only=True)
auto.fillna(value=mean, inplace=True)
# Display auto
auto

  Manufacturer    Model  Drive EngineType  Cylinders  Liters   MPG
0         Audi       A4    All        Gas        4.0     2.0  24.0
1          BMW   328 Ci   Rear        Gas        6.0     3.6  20.0
3    Chevrolet   Malibu  Front        Gas        6.0     3.6  18.0
4         Ford  Mustang   Rear        Gas        6.0     3.7  18.5
5  Rolls-Royce    Ghost   Rear        Gas       12.0     6.6  12.0

In [35]:
row6 = pd.Series(["Mean Values", "", "", "", mean[0], mean[1], mean[2]])
row6.index = auto.columns 
row6

C:\Users\Arnav\AppData\Local\Temp\ipykernel_23908\2147668548.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  row6 = pd.Series(["Mean Values", "", "", "", mean[0], mean[1], mean[2]])

Manufacturer    Mean Values
Model
Drive
EngineType
Cylinders               6.8
Liters                  3.9
MPG                    18.5
dtype: object

In [36]:
row6 = pd.DataFrame(row6).T
row6

  Manufacturer Model Drive EngineType Cylinders Liters   MPG
0  Mean Values                              6.8    3.9  18.5

In [37]:
auto = pd.concat([auto,row6],ignore_index=True)
auto

  Manufacturer    Model  Drive EngineType Cylinders Liters   MPG
0         Audi       A4    All        Gas       4.0    2.0  24.0
1          BMW   328 Ci   Rear        Gas       6.0    3.6  20.0
2    Chevrolet   Malibu  Front        Gas       6.0    3.6  18.0
3         Ford  Mustang   Rear        Gas       6.0    3.7  18.5
4  Rolls-Royce    Ghost   Rear        Gas      12.0    6.6  12.0
5  Mean Values                                  6.8    3.9  18.5

**Enriching Data**

**Leading public datasets.**
| Name	| Link	| Description |
| :---- | :---- | :-----------|
| Kaggle	| kaggle.com	| Over 50,000 datasets on a broad range of subjects. Also provides Jupyter notebooks that analyze the datasets. |
| FiveThirtyEight	| data.fivethirtyeight.com	| Datasets on politics, sports, science, economics, health, and culture, initially developed to support FiveThirtyEight publications. |
| University of California Irvine Machine Learning Repository |	archive.ics.uci.edu	| 622 datasets, primarily in science, engineering, and business. |
| Data.gov	| data.gov	| U.S. government datasets on agriculture, climate, energy, maritime, oceans, and health. |
| World Bank Open Data	| data.worldbank.org	| Global datasets on subjects such as health, education, agriculture, and economics. |
| Nasdaq Data Link	| data.nasdaq.com	| Financial and economic datasets. |

**Deriving data**

A new feature can be derived from existing features in several ways:

- Calculate a new feature from one or more existing features. Ex: Calculate a new feature as the logarithm of an existing feature. Ex: Calculate a new feature as the ratio of one existing feature to another.
- Convert an existing categorical feature to a new numeric feature, or vice versa. Ex: Convert the numeric weight of participants in a wrestling competition to categories such as Heavyweight, Lightweight, and Flyweight.

These techniques might be combined to derive a new feature. Ex: A categorical ranking of country by population might be calculated by rounding **log(population)** to the nearest integer.

***Python data enriching methods.***
| Method	| Parameters	| Description |
| :-------- | :------------ | :---------- |
| concat()	|objs<br>axis=0<br>join='outer'<br>ignore_index=False	| Appends dataframes specified in objs parameter. Appends rows if **axis=0** or columns if **axis=1**. join specifies whether to perform an 'outer' or 'inner' join. Resulting index values are unchanged if **ignore_index=False** or renumbered if **ignore_index=True**. |
| df.apply()	| func<br>axis=0<br>	| Applies the function specified in func parameter to a dataframe df. Applies function to each column if **axis=0** or to each row if **axis=1**. Returns a Series or DataFrame. |
| df.insert()	| loc<br>column<br>value	| Inserts a column to df. **loc** specifies the integer position of the new column. **column** specifies a string or numeric column label. **value** specifies column values as a Scalar or Series. |
| df.merge()	| right<br>how='inner'<br>on=None<br>sort=False	|Joins df with the right dataframe. **how** specifies whether to perform a **'left'**, **'right'**, **'outer'**, or **'inner'** join.  **on** specifies join column labels, which must appear in both dataframes. If **on=None**, all matching labels become join columns. **sort=True** sorts rows on the join columns.|

In [38]:
# Import packages
import pandas as pd

# Import and display the first dataset
appendLeft = pd.read_csv("data/appending.data.left.csv")
appendLeft

         Country      Continent                 GDP  EducationYears
0     Bangladesh           Asia     350,000,000,000             4.7
1          China           Asia  13,180,000,000,000             8.5
2          India           Asia   2,720,000,000,000             5.7
3         Norway         Europe     362,000,000,000            14.2
4  United States  North America  20,650,000,000,000            13.5

In [39]:
# Import and display the second dataset
appendRight = pd.read_csv("data/appending.data.right.csv")
appendRight

         Country      Continent    Population
0     Bangladesh           Asia    129,155,000
1         Brazil  South America    170,115,000
2          China           Asia  1,277,558,000
3          India           Asia  1,013,662,000
4  United States  North America    278,357,000

In [40]:
# Join the first and second datasets.
# Sort the result along join columns.
appendLeft.merge(appendRight, how='outer', sort=True)

,Country,Continent,GDP,EducationYears,Population
0,Bangladesh,Asia,"350,000,000,000",4.7,"129,155,000"
1,Brazil,South America,NaN,NaN,"170,115,000"
2,China,Asia,"13,180,000,000,000",8.5,"1,277,558,000"
3,India,Asia,"2,720,000,000,000",5.7,"1,013,662,000"
4,Norway,Europe,"362,000,000,000",14.2,NaN
5,United States,North America,"20,650,000,000,000",13.5,"278,357,000"

**Diamond Prices**

In [41]:
# Import packages
import numpy as np
import pandas as pd
import seaborn as sns

# Import data and describe
diamonds = pd.read_csv('data/diamonds_casestudy.csv')
diamonds.describe()

,carat,depth,table,price,width,length,height
count,53940.000000,53890.000000,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000
mean,0.797940,61.748892,57.457184,3932.799722,5.731157,5.734526,3.538734
std,0.474011,1.432492,2.234491,3989.439738,1.121761,1.142135,0.705699
min,0.200000,43.000000,43.000000,326.000000,0.000000,0.000000,0.000000
25%,0.400000,61.000000,56.000000,950.000000,4.710000,4.720000,2.910000
50%,0.700000,61.800000,57.000000,2401.000000,5.700000,5.710000,3.530000
75%,1.040000,62.500000,59.000000,5324.250000,6.540000,6.540000,4.040000
max,5.010000,79.000000,95.000000,18823.000000,10.740000,58.900000,31.800000

In [42]:
# Display a sample of the data
# Change random_state for a different sample
diamonds.sample(5, random_state=6)

,carat,cut,color,clarity,depth,table,price,width,length,height
9359,1.00,Good,F,SI1,63.6,62.0,4586,6.30,6.24,3.99
9490,1.10,Very Good,E,SI2,60.1,62.0,4607,6.65,6.69,4.01
27,0.30,Very Good,J,VS2,62.2,57.0,357,4.28,4.30,2.67
7743,1.24,Premium,E,SI2,60.8,57.0,4278,6.98,6.94,4.23
48686,0.77,Fair,J,VS1,61.2,66.0,2005,5.92,5.83,3.60

In [43]:
# Calculate group means based on cut
diamonds.groupby(by=['cut']).mean(numeric_only=True)

,carat,depth,table,price,width,length,height
cut,,,,,,,
Fair,1.046137,64.036839,59.053789,4358.757764,6.246894,6.182652,3.982770
Good,0.849185,62.365436,58.694639,3928.864452,5.838785,5.850744,3.639507
Ideal,0.702837,61.709344,55.951668,3457.541970,5.507451,5.520080,3.401448
Premium,0.891955,61.264177,58.746095,4584.257704,5.973887,5.944879,3.647124
Very Good,0.806381,61.817683,57.956150,3981.759891,5.740696,5.770026,3.559801

In [44]:
# Calculate group sizes for cut
diamonds.groupby(by=['cut']).size()

cut
Fair          1610
Good          4906
Ideal        21551
Premium      13791
Very Good    12082
dtype: int64

In [45]:
# Calculate group means by color
diamonds.groupby(by=['color']).mean(numeric_only=True)

,carat,depth,table,price,width,length,height
color,,,,,,,
D,0.657795,61.697207,57.404590,3169.954096,5.417051,5.421128,3.342827
E,0.657867,61.661545,57.491201,3076.752475,5.411580,5.419029,3.340689
F,0.736538,61.694591,57.433536,3724.886397,5.614961,5.619456,3.464446
G,0.771190,61.756430,57.288629,3999.135671,5.677543,5.680192,3.505021
H,0.911799,61.836192,57.517811,4486.669196,5.983335,5.984815,3.695965
I,1.026927,61.845799,57.577278,5091.874954,6.222826,6.222730,3.845411
J,1.162137,61.887660,57.812393,5323.818020,6.519338,6.518105,4.033251

In [46]:
# Calculate group sizes by color
diamonds.groupby(by=['color']).size()

color
D     6775
E     9797
F     9542
G    11292
H     8304
I     5422
J     2808
dtype: int64

In [47]:
# Pivot table with average price for cut and color combinations
diamonds.pivot_table(values='price', index='color', columns='cut', aggfunc=np.mean)

C:\Users\Arnav\AppData\Local\Temp\ipykernel_23908\2348943837.py:2: FutureWarning: The provided callable <function mean at 0x000001F7E5AD07C0> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  diamonds.pivot_table(values='price', index='color', columns='cut', aggfunc=np.mean)

cut           Fair         Good        Ideal      Premium    Very Good
color
D      4291.061350  3405.382175  2629.094566  3631.292576  3470.467284
E      3682.312500  3423.644159  2597.550090  3538.914420  3214.652083
F      3827.003205  3495.750275  3374.939362  4324.890176  3778.820240
G      4239.254777  4123.482204  3720.706388  4500.742134  3872.753806
H      5135.683168  4276.254986  3889.334831  5216.706780  4535.390351
I      4685.445714  5078.532567  4451.970377  5946.180672  5255.879568
J      4975.655462  4574.172638  4918.186384  6294.591584  5103.513274

In [48]:
# Pivot table with group sizes for cut and color combinations
diamonds.pivot_table(values='price', index='cut', columns='color', aggfunc=np.size)

color         D     E     F     G     H     I    J
cut
Fair        163   224   312   314   303   175  119
Good        662   933   909   871   702   522  307
Ideal      2834  3903  3826  4884  3115  2093  896
Premium    1603  2337  2331  2924  2360  1428  808
Very Good  1513  2400  2164  2299  1824  1204  678

In [49]:
# Pivot table with group sizes for cut and color combinations
diamonds.pivot_table(values='price', index='cut', columns='color', aggfunc=np.size)

color         D     E     F     G     H     I    J
cut
Fair        163   224   312   314   303   175  119
Good        662   933   909   871   702   522  307
Ideal      2834  3903  3826  4884  3115  2093  896
Premium    1603  2337  2331  2924  2360  1428  808
Very Good  1513  2400  2164  2299  1824  1204  678